---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ParameterValuePresenceRule
source: html/16f3d24f-ff8e-5b5e-0349-ddf9a5930576.htm
---
# ParameterValuePresenceRule Members

Derived classes override this method to implement the test that determines
 whether the given element passes this rule or not.